# Lesson 1

Задачи можно сдавать в бота @mits_tsu_bot  
Если умеете - создайте свой репозиторий в github / gitlab / etc и кидайте ссылки на код в бота

## Operators

### Task 0. Пример
##### 0 points

На вход подается 2 числа: A и B (через пробел). Выведите их сумму

Вход:
 - int число A
 - int число B

Выход:
 - int сумма A и B

#### Решение
```c
#include <stdio.h>

int main() {
    int a, b;
    scanf("%d %d", &a, &b);
    printf("%d\n", a + b);
}
```


### Task 1. Температура
###### 50 points

Переведите температуру в градусах Фаренгейта (F) в градусы Цельсия (C) по формуле
`C = 5/9 * (F - 32)`

Вход:
 - float гр. Фаренгейта

Выход:
 - float гр. Цельсия

### Task 2. Часы
###### 50 points

Дано количество секунд с начала дня (00:00).  
Вывести на экран текущее время в формате `HH:MM:SS`

*Подсказка: используйте оператор деления с остатком*

Вход:
 - int кол-во секунд

Выход:
 - Строчка HH:MM:SS (допускается не париться с форматированием, достаточно вывести три верных числа)

Пример:
 - 6426 -> 01:47:06

### Task 3. Маска
###### 50 points

В компьютерных сетях часто приходится вычислять то, что называют *адресом подсети*. IP адреса часто идут в паре с так называемой *маской подсети*. Чтобы вычислить адрес подсети, к которой принадлежит IP адрес, нужно выполнить конъюнкцию маски с самим IP адресом. Напишите программу которая принимает на вход 8 чисел. 4 числа - IP адрес и 4 числа - маска подсети в виде десятичных чисел для каждого октета

Вход:
 - 4 int - IP адрес в формате a.b.c.d
 - 4 int - Маска подсети в десятичном формате a.b.c.d

Выход:
 - IP адрес подсети в формате a.b.c.d

Пример:
 | Входные данные               | Выход        |
|------------------------------|--------------|
| 92.63.70.139<br>255.255.255.224 | 92.63.70.128 |
| 43.51.194.123<br>255.255.128.0  | 43.51.128.0  |

### Task 4. Перевертыш
###### 100 points

На вход подается слово из 4 букв. Выведите его задом наперед. Запрещается использование библиотечных строк и массивов

Вход:
 - Строка - 4 символа

Выход:
 - Строка - 4 символа

 | Входные данные   | Выход        |
|------------------------------|--------------|
| cake | ekac |
| rust  | tsur  |

